In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [7]:
%%sql
create database besant;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [8]:
%%sql
use besant;
create table student (
    id int primary key,
    name varchar(50),
    age int,
    city varchar(50)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
describe student;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('age', 'int', 'YES', '', None, ''),
 ('city', 'varchar(50)', 'YES', '', None, '')]

In [3]:
%%sql
use besant;
SELECT * FROM EMPLOYEE;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
2 rows affected.

[(1, 'VISWAA', 'VISWAAESWARAN@GMAIL.COM', 21, 'ACTIVE'),
 (2, 'SATHISH', 'SATHISH@GMAIL.COM', 22, 'active')]

In [8]:
%%sql
use besant;
SELECT * FROM EMPLOYEESS;
##1.Find employees whose salary is greater than 60,000.
select * from employeess where salary > 60000;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
10 rows affected.
6 rows affected.

[(1, 'Amit Kumar', 28, 'M', 'IT', 'Software Engineer', Decimal('65000.00'), 'Bengaluru', datetime.date(2020, 3, 15), 4),
 (4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (5, 'Vivek Reddy', 35, 'M', 'Operations', 'Manager', Decimal('90000.00'), 'Hyderabad', datetime.date(2018, 2, 12), 8),
 (7, 'Arjun Mehta', 31, 'M', 'IT', 'Team Lead', Decimal('85000.00'), 'Chennai', datetime.date(2019, 12, 1), 7),
 (9, 'Rohit Verma', 30, 'M', 'Finance', 'Senior Accountant', Decimal('67000.00'), 'Delhi', datetime.date(2020, 1, 25), 5),
 (10, 'Divya Nair', 33, 'F', 'Operations', 'Supervisor', Decimal('75000.00'), 'Bengaluru', datetime.date(2019, 6, 14), 7)]

In [9]:
%%sql
##2.Display employees whose age is less than 30.
SELECT * FROM employeess WHERE Age < 30;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Amit Kumar', 28, 'M', 'IT', 'Software Engineer', Decimal('65000.00'), 'Bengaluru', datetime.date(2020, 3, 15), 4),
 (2, 'Riya Sharma', 26, 'F', 'HR', 'HR Executive', Decimal('48000.00'), 'Mumbai', datetime.date(2021, 5, 10), 3),
 (4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (6, 'Sneha Gupta', 27, 'F', 'Marketing', 'Marketing Analyst', Decimal('55000.00'), 'Pune', datetime.date(2021, 9, 17), 3),
 (8, 'Neha Joshi', 24, 'F', 'HR', 'Recruiter', Decimal('42000.00'), 'Kolkata', datetime.date(2022, 4, 10), 2)]

In [10]:
%%sql
## 3.Find employees who have exactly 5 years of experience.
SELECT * FROM employeess WHERE Experience = 5;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (9, 'Rohit Verma', 30, 'M', 'Finance', 'Senior Accountant', Decimal('67000.00'), 'Delhi', datetime.date(2020, 1, 25), 5)]

In [11]:
%%sql
SELECT * FROM employeess WHERE Join_Date < '2020-01-01';

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(3, 'Karan Patel', 32, 'M', 'Finance', 'Accountant', Decimal('58000.00'), 'Ahmedabad', datetime.date(2019, 8, 20), 6),
 (5, 'Vivek Reddy', 35, 'M', 'Operations', 'Manager', Decimal('90000.00'), 'Hyderabad', datetime.date(2018, 2, 12), 8),
 (7, 'Arjun Mehta', 31, 'M', 'IT', 'Team Lead', Decimal('85000.00'), 'Chennai', datetime.date(2019, 12, 1), 7),
 (10, 'Divya Nair', 33, 'F', 'Operations', 'Supervisor', Decimal('75000.00'), 'Bengaluru', datetime.date(2019, 6, 14), 7)]

In [12]:
%%sql
SELECT * FROM employeess WHERE Salary <> 55000;

 * mysql+mysqlconnector://root:***@localhost
9 rows affected.

[(1, 'Amit Kumar', 28, 'M', 'IT', 'Software Engineer', Decimal('65000.00'), 'Bengaluru', datetime.date(2020, 3, 15), 4),
 (2, 'Riya Sharma', 26, 'F', 'HR', 'HR Executive', Decimal('48000.00'), 'Mumbai', datetime.date(2021, 5, 10), 3),
 (3, 'Karan Patel', 32, 'M', 'Finance', 'Accountant', Decimal('58000.00'), 'Ahmedabad', datetime.date(2019, 8, 20), 6),
 (4, 'Pooja Singh', 29, 'F', 'IT', 'UI Designer', Decimal('72000.00'), 'Delhi', datetime.date(2020, 10, 5), 5),
 (5, 'Vivek Reddy', 35, 'M', 'Operations', 'Manager', Decimal('90000.00'), 'Hyderabad', datetime.date(2018, 2, 12), 8),
 (7, 'Arjun Mehta', 31, 'M', 'IT', 'Team Lead', Decimal('85000.00'), 'Chennai', datetime.date(2019, 12, 1), 7),
 (8, 'Neha Joshi', 24, 'F', 'HR', 'Recruiter', Decimal('42000.00'), 'Kolkata', datetime.date(2022, 4, 10), 2),
 (9, 'Rohit Verma', 30, 'M', 'Finance', 'Senior Accountant', Decimal('67000.00'), 'Delhi', datetime.date(2020, 1, 25), 5),
 (10, 'Divya Nair', 33, 'F', 'Operations', 'Supervisor', Decimal('75000.00'), 'Bengaluru', datetime.date(2019, 6, 14), 7)]